## Plan Result (prod_app_registrations)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;DTS Orphaned Resource Cleanup&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;DTS Orphaned Resource Cleanup&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["DTS Orphaned Resource Cleanup"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Orphaned Resource Cleanup"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__dtspo-orphan-resources-cleanup_ref_refs__heads__dxw__orphan-testing"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__dtspo-orphan-resources-cleanup_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/master"
    }

  # module.this.azuread_service_principal.this["DTS Orphaned Resource Cleanup"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":49,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->